{
    "descriptions": [
        {
            "project": "Pillars of Light",
            "text": "A Senior Design Project made by me and two other friends, Pillars of Light is a 1st-Person puzzle game developed in Unreal Engine where the player explores an interactive set of levels to solve puzzles while avoiding enemies along the way. Ultimately, your goal is to light a beacon that can (hopefully) signal to your crew that you are still alive and need to be rescued.\n\nThis game highlights the utilization of UE5's Blueprint Visual Scripting as well as a variety of level designing features. These game mechanics provide a glimpse behind the game engine's ability to foster engagement and interaction. It also serves as a demonstration of the game design process for other game developers to gain insight and takeaways from.",
            "outside_link": "None; outside of my control",
            "download_link": "None; outside of my control",
            "media": [
                "/POL_1.png",
                "/POL_2.png",
                "/POL_3.png"
            ]
        },
        {
            "project": "Bouncing Bob",
            "text": "Bouncing Bob is a Computer Graphics class project designed by me and three other friends. It is a 2D physics-based puzzle game made in Unity where you must guide a little bouncing robot named Bob through an expansive laboratory and help him escape by moving the platforms within each level, often using momentum to your advantage. There are 20 levels in total, with each one building upon previous levels, testing your skills further, and culminating in a final challenge that - fair warning - is hard. <br/><br/>This project is also notable in that it taught me how to best stay focused in completing a fully fleshed out video game over a period of months or even years.",
            "outside_link": "None",
            "download_link": "Coming soon",
            "media": [
                "/BouncingBob2.png",
                "/BouncingBob3.png"
            ]
        },
        {
            "project": "The Ruins",
            "text": "Created by me and one other friend, the Ruins is a small 2D top-down game submitted to a local game jam hosted directly by Cedarville University. In it, you traverse some seemingly endless ruins in search of treasure. What makes these ruins particularly unique is that they procedurally generate as you explore and just might defy euclidian geometry. The Orbs you can place down will be critical to remembering your path. Eventually, however, the treasure will present itself, and you must quickly return to the beginning room and escape before the ruins collapse.<br/><br/>This project is also notable in that since the game jam only ran for 8 hours, my time management skills and focus were given quite the test.",
            "outside_link": "https://mistertelescope.itch.io/the-ruins",
            "download_link": "Coming soon",
            "media": [
                "/TheRuins1.jpg",
                "/TheRuins.png",
                "/TheRuins2.png"
            ]
        },
        {
            "project": "Spunky Spore",
            "text": "Created by me and five other friends - many of whom I met for the first time - and created for Global Game Jam 2023, Spunky Spore is a 2D stealth platformer where Cordy Scept, a teenage mushroom girl who sprouts from within a dangerous cave, must escape to the outside world without being spotted. Although she can't jump, she can grapple onto mycelium within the caves to gain some high ground, as well as hide on mycelium to avoid being spotted. Just be careful, as most of the Mantis Men within the cave can easily tear her apart.<br/><br/>This project is also my first project to incorporate Wwise, which allows composers and sound designers to encode advanced spatial audio into the game environment.",
            "outside_link": "Coming soon",
            "download_link": "None; link no longer works :(",
            "media": [
                "/SpunkySpore2.jpeg",
                "/SpunkySpore.png",
                "/SpunkySpore3.png"
            ]
        },
        {
            "project": "Aimer Sans Voir",
            "text": "\"Discover love... and checkmate. Play as a character who is looking to become a chess champion, and perhaps you will find love along the way.\" - Logan Carter, the Game Composer and the one who first conceived this funny idea<br/><br/>Created by me and six other friends for Global Game Jam 2024, Aimer Sans Voir was perhaps our most ambitious game jam project so far, as we tried to learn a dialogue tool called Ink and recreate chess gameplay from the ground up. It wasn't fully completed in time, but we did get it to a playable state and present it to the other game jam participants.<br/><br/>Also, we managed to implement En Passant.",
            "outside_link": "https://globalgamejam.org/games/2024/aimer-sans-voir-4",
            "download_link": "Coming soon",
            "media": [
                "/AimerSansVoir.png",
                "/AimerSansVoir2.png"
            ]
        },
        {
            "project": "Tetris PvE",
            "text": "Tetris PvE is a Machine Learning project designed by me and one other classmate. The idea was simple: develop a Tetris AI that would be able to play the game on its own and compete against a human player. Completing this task, however, was far from simple, as there were many bugs with the vision detection that needed to be ironed out.<br/><br/>While not fully finished in time, the concept proved to be doable and was certainly cool to watch regardless, and we ended up learning a great deal about Machine Learning as a whole thanks to the class.",
            "outside_link": "None",
            "download_link": "None; not fully finished",
            "media": [
                "/TetrisAI.png"
            ]
        },
        {
            "project": "Rise To Battle",
            "text": "Created by me and two other friends, Rise To Battle was our submission to Global Game Jam 2022 as well as my very first game jam project. It's a one-on-one battle where your objective is to climb the platforms to the top, with the twist that both players can control platforms on each other's path, resulting in two goals: get to the top, and stop your opponent from doing so.<br/><br/>While the project was never properly finished nor bug-fixed (the pause menu is constantly there, for example), I did appreciate getting to participate in my first game jam and learn where my game dev needs to best improve in, and I was eager to participate in the next game jam that I could.",
            "outside_link": "None; link no longer works :(",
            "download_link": "Coming Soon",
            "media": [
                "/RiseToBattle1.png",
                "/RiseToBattle2.png",
                "/RiseToBattle3.png"
            ]
        },
        {
            "project": "2.5D Test",
            "text": "The very first prototype I ever developed in Unity, 2.5D Test was a test to know how feasible it would be to develop a 3D Platformer game where the characters were 2D sprites with 3D collision. There are several \"modules\" you can pick up and use to overcome platforming challenges and fend off hostile opponents. I also tested several other game mechanics with this prototype: dialogue, monorail carts and paths, a health system, and a file saving system. Features that have been tweaked heavily over time include collision physics and camera movement.<br/><br/>For now, this prototype is shelved, but I will definitely be using plenty of its features for future projects.",
            "outside_link": "None",
            "download_link": "Coming Soon",
            "media": [
                "/2AAHDT.png",
                "/2AAHDT_2.png",
                "/2AAHDT_3.png"
            ]
        },
        {
            "project": "Steve's Adventure",
            "text": "A prototype I began to develop because I was really intrigued by the \"One Block At A Time\" April Fools update for a game called Minecraft, Steve's Adventure is a 2D Platformer where you can pick up blocks, as well as any moving entities, to progress through the game. This prototype is notable because I made an ambitious goal to create my very own collision system based purely on rectangles. It would need to be tweaked as time went on, but even at the beginning it was robust and smooth. Also implemented were individual block hardnesses, peaceful and hostile entities, water, a crafting workbench, and an excel file importer for loading the world.<br/><br/>This project was actually restarted as \"One Block Upon A Time\" in the hopes of developing a more distinct gameplay style. Not having to worry about a DMCA takedown was also a plus.",
            "outside_link": "None",
            "download_link": "Coming Soon",
            "media": [
                "/StevesAdventure.png",
                "/StevesAdventure2.png",
                "/StevesAdventure3.png"
            ]
        },
        {
            "project": "One Block Upon A Time",
            "text": "A prototype I began to develop as a continuation to Steve's Adventure, One Block Upon A Time is a 2D Platformer where the entire terrain is destructable, and you must complete an objective in each level, which can range from reaching the goal or collecting a certain number of resources in time. While picking up blocks is still an option, your best way to traverse is by running really fast and breaking blocks in your way as you run, as well as super jumping to gain height. You can also pick up and throw several animals that have unique gameplay effects, such as a double-jump chicken, a launcher crab, a rocket cat, and an explosive capybara, all of which would provide a clear (though not necessarily correct) path to complete the levels.<br/><br/>I hope to develop this prototype into a fully fleshed-out game one day, but due to time constraints I have to shelve it for now.",
            "outside_link": "None",
            "download_link": "Coming Soon",
            "media": [
                "/1BUAT_2.png",
                "/1BUAT_3.png",
                "/1BUAT_4.png"
            ]
        }
    ]
}