{
    "descriptions": [
        {
            "project": "Pillars of Light",
            "text": "A Senior Design Project made by me and two other friends, Pillars of Light is a 1st-Person puzzle game developed in Unreal Engine where the player explores an interactive set of levels to solve puzzles while avoiding enemies along the way. Ultimately, your goal is to light a beacon that can (hopefully) signal to your crew that you are still alive and need to be rescued.\n\nThis game highlights the utilization of UE5's Blueprint Visual Scripting as well as a variety of level designing features. These game mechanics provide a glimpse behind the game engine's ability to foster engagement and interaction. It also serves as a demonstration of the game design process for other game developers to gain insight and takeaways from.",
            "outside_link": "",
            "download_link": "",
            "media": [
                "",
                ""
            ]
        },
        {
            "project": "Bouncing Bob",
            "text": "Bouncing Bob is a Computer Graphics class project designed by me and three other friends. It is a 2D physics-based puzzle game made in Unity where you must guide a little bouncing robot named Bob through an expansive laboratory and help him escape by moving the platforms within each level, often using momentum to your advantage. There are 20 levels in total, with each one building upon previous levels, testing your skills further, and culminating in a final challenge that - fair warning - is hard. <br/><br/>This project is also notable in that it taught me how to best stay focused in completing a fully fleshed out video game over a period of months or even years.",
            "outside_link": "",
            "download_link": "",
            "media": [
                "",
                ""
            ]
        },
        {
            "project": "The Ruins",
            "text": "Created by me and one other friend, the Ruins is a small 2D top-down game submitted to a local game jam hosted directly by Cedarville University. In it, you traverse some seemingly endless ruins in search of treasure. What makes these ruins particularly unique is that they procedurally generate as you explore and just might defy euclidian geometry. The Orbs you can place down will be critical to remembering your path. Eventually, however, the treasure will present itself, and you must quickly return to the beginning room and escape before the ruins collapse.<br/><br/>This project is also notable in that since the game jam only ran for 8 hours, my time management skills and focus were given quite the test.",
            "outside_link": "",
            "download_link": "",
            "media": [
                "",
                ""
            ]
        },
        {
            "project": "Spunky Spore",
            "text": "Created by me and five other friends - many of whom I met for the first time - and created for Global Game Jam 2023, Spunky Spore is a 2D stealth platformer where Cordy Scept, a teenage mushroom girl who sprouts from within a dangerous cave, must escape to the outside world without being spotted. Although she can't jump, she can grapple onto mycelium within the caves to gain some high ground, as well as hide on mycelium to avoid being spotted. Just be careful, as most of the Mantis Men within the cave can easily tear her apart.<br/><br/>This project is also my first project to incorporate Wwise, which allows composers and sound designers to encode advanced spatial audio into the game environment.",
            "outside_link": "",
            "download_link": "",
            "media": [
                "",
                ""
            ]
        },
        {
            "project": "Aimer Sans Voir",
            "text": "\"Discover love... and checkmate. Play as a character who is looking to become a chess champion, and perhaps you will find love along the way.\" - Logan Carter, the Game Composer and the one who first conceived this funny idea\n\nCreated by me and six other friends for Global Game Jam 2024, Aimer Sans Voir was perhaps our most ambitious game jam project so far, as we tried to learn a dialogue tool called Ink and recreate chess gameplay from the ground up. It wasn't fully completed in time, but we did get it to a playable state and present it to the other game jam participants.\n\nAlso, we managed to implement En Passant.",
            "outside_link": "",
            "download_link": "",
            "media": [
                "",
                ""
            ]
        },
        {
            "project": "2.5D Test",
            "text": "Desc Text 5",
            "outside_link": "",
            "download_link": "",
            "media": [
                "",
                ""
            ]
        },
        {
            "project": "Steve's Adventure",
            "text": "Desc Text 6",
            "outside_link": "",
            "download_link": "",
            "media": [
                "",
                ""
            ]
        },
        {
            "project": "One Block Upon A Time",
            "text": "Desc Text 7",
            "outside_link": "",
            "download_link": "",
            "media": [
                "",
                ""
            ]
        },
        {
            "project": "Rise To Battle",
            "text": "Desc Text 8",
            "outside_link": "",
            "download_link": "",
            "media": [
                "",
                ""
            ]
        },
        {
            "project": "Tetris PvE",
            "text": "Desc Text 9",
            "outside_link": "",
            "download_link": "",
            "media": [
                "",
                ""
            ]
        }
    ]
}